## Production: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 9 to add, 3 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/86ac5a3d0ee43ab44e935e7f7466dc4489d2463bc43a6bc4502e332561213118.zip" -> "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.zip"
        id                             = "notify-slack-critical"
      ~ last_modified                  = "2021-10-21T13:35:45.948+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-critical:5" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier     = "5" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_critical.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_critical/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7273500163395691705" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/86ac5a3d0ee43ab44e935e7f7466dc4489d2463bc43a6bc4502e332561213118.zip" -> "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.zip"
          ~ "timestamp" = "1639149532637693000" -> "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        }
    }

  # module.notify_slack_general.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/832d85befec632ce726af6b2a9ff4d9e909f89cb16b8c704a8f31d8fc03ff4d6.zip" -> "builds/426ff060077d19a65faa8d89e6af6273a3a6d70524f356cd1c2b2e846be19aa2.zip"
        id                             = "notify-slack-general"
      ~ last_modified                  = "2021-10-21T13:35:57.872+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-general:4" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier     = "4" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_general.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_general/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/426ff060077d19a65faa8d89e6af6273a3a6d70524f356cd1c2b2e846be19aa2.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/426ff060077d19a65faa8d89e6af6273a3a6d70524f356cd1c2b2e846be19aa2.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_general.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4116816145270097498" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/832d85befec632ce726af6b2a9ff4d9e909f89cb16b8c704a8f31d8fc03ff4d6.zip" -> "builds/426ff060077d19a65faa8d89e6af6273a3a6d70524f356cd1c2b2e846be19aa2.zip"
          ~ "timestamp" = "1639149527198976000" -> "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        }
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/ab75980706fcec97f8be52b086e3e025907688582f7c967947d4eda587a8e52a.zip" -> "builds/8d55fd6785ead0e3332405256a36c04867b93585e586c3960dcc5d36f5f5c84b.zip"
        id                             = "notify-slack-warning"
      ~ last_modified                  = "2021-10-21T13:35:51.907+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-warning:5" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier     = "5" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_warning.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + ".terraform/modules/notify_slack_warning/functions/notify_slack.py",
                      + null,
                    ],
                ]
              + filename      = "builds/8d55fd6785ead0e3332405256a36c04867b93585e586c3960dcc5d36f5f5c84b.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8d55fd6785ead0e3332405256a36c04867b93585e586c3960dcc5d36f5f5c84b.plan.json"
      + id                   = (known after apply)
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2640763696400521726" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ab75980706fcec97f8be52b086e3e025907688582f7c967947d4eda587a8e52a.zip" -> "builds/8d55fd6785ead0e3332405256a36c04867b93585e586c3960dcc5d36f5f5c84b.zip"
          ~ "timestamp" = "1639149532219238000" -> "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        }
    }

Plan: 9 to add, 3 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>